src/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Организации/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
    проверенныеРеквизиты = Новый Массив();
    Если проверитьЗаполнениеИНН() = Ложь Тогда
        проверенныеРеквизиты.Добавить("ИНН");
        отказ = Истина;
    КонецЕсли;

    исключитьПроверенныеРеквизитыИзМассива(проверенныеРеквизиты, проверяемыеРеквизиты);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
    Если ЭтотОбъект.ТипОрганизации <> Перечисления.ТипыОрганизаций.ЮридическоеЛицо
        И ЗначениеЗаполнено(ЭтотОбъект.ГлавныйБухгалтер) Тогда

        ЭтотОбъект.ГлавныйБухгалтер = Справочники.Сотрудники.ПустаяСсылка();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Процедура исключитьПроверенныеРеквизитыИзМассива(Знач проверенныеРеквизитов, Знач проверяемыеРеквизиты) Экспорт
    Для Каждого элементМассива Из проверенныеРеквизитов Цикл
        ПорядковыйНомер = проверяемыеРеквизиты.Найти(элементМассива);
        Если ПорядковыйНомер <> Неопределено Тогда
            проверяемыеРеквизиты.Удалить(ПорядковыйНомер);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

Функция проверитьЗаполнениеИНН()
    #Область ДиагностикаПолей
    ДиагностикаКлиентСервер.Утверждение(ЗначениеЗаполнено(ЭтотОбъект.ИНН), "Поле ""ИНН"" должно быть заполнено.");
    ДиагностикаКлиентСервер.Утверждение(ЗначениеЗаполнено(ЭтотОбъект.ТипОрганизации), "Поле ""ТипОрганизации"" должно быть заполнено.");
    ДиагностикаКлиентСервер.Утверждение(
        ЭтотОбъект.ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо
            ИЛИ ЭтотОбъект.ТипОрганизации = Перечисления.ТипыОрганизаций.ИндивидуальныйПредприниматель,
            "Поле ""ТипОрганизации"" должно иметь значение из списка: [ЮридическоеЛицо, ИндивидуальныйПредприниматель].");
    #КонецОбласти // ДиагностикаПолей

    ожидаемаяДлинаИНН = ?(ЭтотОбъект.ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо, 10, 12);
    фактическаяДлинаИНН = СтрДлина(ЭтотОбъект.ИНН);
    Если фактическаяДлинаИНН <> ожидаемаяДлинаИНН Тогда
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = СтрШаблон(
                "Проверьте правильность заполнения поля ""ИНН"".
                |Длина строки поля ""ИНН"" должна быть равна ""%1"" знакам, указанная длина строки - ""%2"" знаков.",
                ожидаемаяДлинаИНН, фактическаяДлинаИНН);
        сообщение.Поле = "ИНН";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();

        Возврат Ложь;
    КонецЕсли;

    Возврат Истина;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
